[
    {
        "id": "",
        "title": "Aglaia Yearbook",
        "description": "Learn about business by picking a business related topic, learning about it, and competing through roleplaying business scenarios and completing an exam.",
        "subjects": [""],
        "advisor": "Ms. Gemme",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id":  "",
        "title": "CHAOS",
        "description": "Work as a a part of team CHAOS 131. Develop a robot every year to compete at competitions while also spreading STEM throughout community through outreach activities.",
        "subjects": [""],
        "advisor": "Mr. Chretien",
        "meetingTime":  [""],
        "calendar": "https://www.chaos131.com/news/calendar",
        "image": ""
    },
    {
        "id": "",
        "title": "Crochet Club",
        "description": "Make crocheted items for Central's very own coat closet! Come learn to crochet and/or take some down time to create something to help others.  Meetings are Tuesdays after school in Room 21.",
        "subjects": [""],
        "advisor": "Mrs. St. Onge",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "CVN",
        "description": "CVN is the close circuit television network at Central High School made to foster CENTRAL PRIDE. This is achieved by keeping the student body informed of any upcoming events and /or meetings, student achievements, and the weather.",
        "subjects": [""],
        "advisor": "Mr. Moulton",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "DECA",
        "description": "Central's DECA prepares emerging leaders and entrepreneurs in marketing, finance, hospitality and management. DECA members compete annually for a chance to participate in DECA's International Conference. Members can also participate in various other events, fundraisers, and conferences throughout the year.",
        "subjects": [],
        "advisor": "Ms. Fontaine",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "ID": "",
        "title": "Granite State Challenge",
        "description": "Central's Granite State Challenge team competes in trivia surrounding various subject areas. Students complete a test to qualify for the Granite State Challenge show, where teams from different schools compete in a trivia tournament.",
        "subjects": [""],
        "advisor": "Mr. Doyle",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "ID": "",
        "title": "GSA",
        "description": "The CHS Gender Sexuality Alliance is a group that advocates for the inclusion, support, and acceptance of people with diverse sexual orientations and gender identities. The alliance strives to promote understanding, acceptance, and respect within the community through various events celebrating diversity.",
        "subjects": [""],
        "advisor": "Ms. Brunk",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "Key Club",
        "description": "A volunteer community and school service organization, members earn service hours through numerous fun events throughout the year. Membership meetings are in the library on the second Wednesday of every month at 3:00 PM. All Central students are welcome.",
        "subjects": [""] ,
        "advisor": "Mrs. St. Onge",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "Law Club",
        "description": "Meet every other Thursday before school in the PA building to discuss current legal issues and events.",
        "subjects": [""] ,
        "advisor": "Mrs. Ferro",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "Maskers Drama Club",
        "description": "Maskers is Central's theater / drama club. Students prepare plays and musicals for the school.",
        "subjects": [""] ,
        "advisor": "Ms. Potoma",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "Math Team",
        "description": "Go to different math events throughout the state where you compete in five different subjects of math. Students get to compete in both individual and team rounds while having fun doing math.",
        "subjects": ["Math"],
        "advisor": "Mrs. Machnik",
        "meetingTime": ["Wednesday"],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "National Art Honors Society",
        "description": "National Art Honor Society works with students who have a strong interest in the visual arts. Field trips and community based art activities encompass the activities.",
        "subjects": [""] ,
        "advisor": "Mr. Burgess",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "National English Honors Society",
        "description": "Members are comprised of students who have maintained a B+ or better in every English class for at least three semesters, a cumulative 2.75 GPA, and must be actively passing all classes.",
        "subjects": [""] ,
        "advisor": "Ms. Pennington, Ms. MacDonald",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "National Honors Society",
        "description": "Students who have maintained a 3.5 unweighted or 9.0 weighted GPA will be invited to submit candidate information sheets to apply to NHS. Their candidacy will then be assessed based on their character, leadership, and volunteerism.",
        "subjects": [""] ,
        "advisor": "Mrs. Smith Tourigny",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "ID": "",
        "title": "Oracle",
        "description": "The Oracle is Central's literary/arts magazine, publishing student work continuously since 1903. Students may submit poetry, short stories, essays, book reviews, photos and art work for publishing.",
        "subjects": [""],
        "advisor": "Mrs. MacDonald",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "ID": "",
        "title": "SLLED",
        "description": "Meet every other Tuesday after school in the PA building to discuss ethical and legal issues and events. Students learn principles for collaborative discourse and apply those values to discussions of ethical issues, under the guidance of a trained teacher- coordinator.",
        "subjects": [""],
        "advisor": "Mrs. Ferro",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "Story Tellers Club",
        "description": "Create and share storys of all kinds with different people.",
        "subjects": ["Writing"],
        "advisor": "Mr. Compagna",
        "meetingTime": ["Thursday"],
        "calendar": "",
        "image": ""
    },
    {
        "ID": "",
        "title": "Student Council",
        "description": "The Central Student Council represents the entire student body, and the leaders are elected by the student population. They serve as the voice for the students by communicating with the faculty, administration, and Board of School Committee. Members also plan for spirit weeks and participate in community service projects.",
        "subjects": [""],
        "advisor": "Mr. Howe",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "ID": "",
        "title": "Tabletop Club",
        "description": "Play or learn to play various tabletop games with other students.",
        "subjects": [""],
        "advisor": "Mr. Toohey",
        "meetingTime": [""],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "Tri-M",
        "description": "Tri-M is the music honors society at Central. Members spread music throughout the community and participate in events around the music department.",
        "subjects": ["Music", "Honors Society", "Service"],
        "advisor": "Mrs. Redmond",
        "meetingTime": ["Thursday"],
        "calendar": "",
        "image": ""
    },
    {
        "id": "",
        "title": "World Language Honors Society",
        "description": "The purpose of the Central's World Language Honor Society is to recognize scholastic achievement in the study of German, French, Spanish and Latin. The Society promotes interest in the study of a world language and promotes cultural understanding within the Central community.",
        "subjects": ["Music", "Honors Society", "Service"],
        "advisor": "Mrs. LeBrun",
        "meetingTime": ["Thursday"],
        "calendar": "",
        "image": ""
    }
]